app/controllers/exams_controller.rb

SELECT * FROM "exams" WHERE ("exams"."id" = 41)
UPDATE "exams" SET "updated_at" = '2010-08-29 01:07:06', "finished" = 't' WHERE "id" = 41
---
  def update
    @exam = Exam.find params[:id]
    if current_user == @exam.owner || !current_user.signed_up? && @exam.session_id == session[:session_id]
      @exam.update_attributes params[:exam]

SELECT * FROM "responses" WHERE ("responses".exam_id = 22) LIMIT 1
---
  def create
    @exam = Exam.new(params[:exam])
    if current_user.signed_up?
      @exam.owner = current_user
    else
      @exam.session_id = session[:session_id]
    end
    hobo_create @exam do
      flash[:notice] = ''
      redirect_to edit_response_path(@exam.responses.first)