app/controllers/questions_controller.rb

  def rate
    @question = Question.find(params[:id])
---
SELECT * FROM "questions" WHERE ("questions"."id" = 7)