app/controllers/responses_controller.rb

  def edit
    @response = Response.find params[:id]
---
SELECT * FROM "responses" WHERE ("responses".exam_id = 22)

  def update
    @response = Response.find params[:id]
    @exam = @response.exam
    if current_user == @exam.owner || !current_user.signed_up? && @exam.session_id == session[:session_id]
      if @response.update_attributes params[:response]
---
SELECT * FROM "responses" WHERE ("responses".exam_id = 24)
UPDATE "responses" SET "updated_at" = '2010-08-26 17:34:32', "text_answer" = '700' WHERE "id" = 55